evidence/qwen38-27b-v1.0/gx10-01-xxj/20260902-20260903/raw/benchmarks-raw/local-llm-cross-platform-benchmark/qwen38-27b-v1.0/gx10-single/formal-32k/bf16/formal100/formal100.log.txt
nohup: ignoring input
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe73d720bfba0>, trust_remote_code=False, seed=20260831, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://<IP_REDACTED>:8000', host='<IP_REDACTED>', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='qwen38-27b-bf16-f5', input_len=32768, output_len=256, tokenizer='$HOME/xxj/models/original/qwen3.8-27b/bf16/1d4bf0f2ff6012fd82039f2fa52739d0dd7c60c0', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=1, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='$HOME/xxj/benchmarks/raw/local-llm-cross-platform-benchmark/qwen38-27b-v1.0/gx10-single/formal-32k/bf16/formal100', result_filename='formal100.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-e0d4799a-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-01 <IPV6_REDACTED> [utils.py:90] Sampling input_len from [32768, 32768] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...

  0%|          | 0/1 [00:00<?, ?it/s]
100%|██████████| 1/1 [01:44<00:00, 104.60s/it]
100%|██████████| 1/1 [01:44<00:00, 104.60s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [01:45<<IPV6_REDACTED>, 105.26s/it]
  2%|▏         | 2/100 [03:27<<IPV6_REDACTED>, 103.30s/it]
  3%|▎         | 3/100 [05:08<<IPV6_REDACTED>, 102.55s/it]
  4%|▍         | 4/100 [06:50<<IPV6_REDACTED>, 102.29s/it]
  5%|▌         | 5/100 [08:32<<IPV6_REDACTED>, 102.13s/it]
  6%|▌         | 6/100 [10:14<<IPV6_REDACTED>, 102.01s/it]
  7%|▋         | 7/100 [11:56<<IPV6_REDACTED>, 102.01s/it]
  8%|▊         | 8/100 [13:38<<IPV6_REDACTED>, 101.99s/it]
  9%|▉         | 9/100 [15:20<<IPV6_REDACTED>, 101.91s/it]
 10%|█         | 10/100 [16:59<<IPV6_REDACTED>, 101.05s/it]
 11%|█         | 11/100 [18:38<<IPV6_REDACTED>, 100.48s/it]
 12%|█▏        | 12/100 [20:17<<IPV6_REDACTED>, 100.09s/it]
 13%|█▎        | 13/100 [21:56<<IPV6_REDACTED>, 99.80s/it] 
 14%|█▍        | 14/100 [23:35<<IPV6_REDACTED>, 99.60s/it]
 15%|█▌        | 15/100 [25:14<<IPV6_REDACTED>, 99.45s/it]
 16%|█▌        | 16/100 [26:54<<IPV6_REDACTED>, 99.35s/it]
 17%|█▋        | 17/100 [28:33<<IPV6_REDACTED>, 99.27s/it]
 18%|█▊        | 18/100 [30:12<<IPV6_REDACTED>, 99.23s/it]
 19%|█▉        | 19/100 [31:51<<IPV6_REDACTED>, 99.22s/it]
 20%|██        | 20/100 [33:30<<IPV6_REDACTED>, 99.20s/it]
 21%|██        | 21/100 [35:09<<IPV6_REDACTED>, 99.24s/it]
 22%|██▏       | 22/100 [36:49<<IPV6_REDACTED>, 99.19s/it]
 23%|██▎       | 23/100 [38:28<<IPV6_REDACTED>, 99.16s/it]
 24%|██▍       | 24/100 [40:07<<IPV6_REDACTED>, 99.14s/it]
 25%|██▌       | 25/100 [41:46<<IPV6_REDACTED>, 99.13s/it]
 26%|██▌       | 26/100 [43:25<<IPV6_REDACTED>, 99.12s/it]
 27%|██▋       | 27/100 [45:04<<IPV6_REDACTED>, 99.11s/it]
 28%|██▊       | 28/100 [46:43<<IPV6_REDACTED>, 99.10s/it]
 29%|██▉       | 29/100 [48:22<<IPV6_REDACTED>, 99.09s/it]
 30%|███       | 30/100 [50:01<<IPV6_REDACTED>, 99.09s/it]
 31%|███       | 31/100 [51:40<<IPV6_REDACTED>, 99.08s/it]
 32%|███▏      | 32/100 [53:19<<IPV6_REDACTED>, 99.08s/it]
 33%|███▎      | 33/100 [54:58<<IPV6_REDACTED>, 99.08s/it]
 34%|███▍      | 34/100 [56:38<<IPV6_REDACTED>, 99.07s/it]
 35%|███▌      | 35/100 [58:17<<IPV6_REDACTED>, 99.07s/it]
 36%|███▌      | 36/100 [59:56<<IPV6_REDACTED>, 99.06s/it]
 37%|███▋      | 37/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.06s/it]
 38%|███▊      | 38/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.07s/it]
 39%|███▉      | 39/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.07s/it]
 40%|████      | 40/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.07s/it]
 41%|████      | 41/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.07s/it]
 42%|████▏     | 42/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.08s/it]
 43%|████▎     | 43/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.09s/it]
 44%|████▍     | 44/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.09s/it]
 45%|████▌     | 45/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.08s/it]
 46%|████▌     | 46/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.06s/it]
 47%|████▋     | 47/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.06s/it]
 48%|████▊     | 48/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.05s/it]
 49%|████▉     | 49/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.06s/it]
 50%|█████     | 50/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.06s/it]
 51%|█████     | 51/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.07s/it]
 52%|█████▏    | 52/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.08s/it]
 53%|█████▎    | 53/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.08s/it]
 54%|█████▍    | 54/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.07s/it]
 55%|█████▌    | 55/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.07s/it]
 56%|█████▌    | 56/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.05s/it]
 57%|█████▋    | 57/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.05s/it]
 58%|█████▊    | 58/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.05s/it]
 59%|█████▉    | 59/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.05s/it]
 60%|██████    | 60/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.04s/it]
 61%|██████    | 61/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.04s/it]
 62%|██████▏   | 62/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.05s/it]
 63%|██████▎   | 63/100 [<IPV6_REDACTED><<IPV6_REDACTED>, 99.05s/it]
 64%|██████▍   | 64/100 [<IPV6_REDACTED><59:25, 99.05s/it]  
 65%|██████▌   | 65/100 [<IPV6_REDACTED><57:47, 99.06s/it]
 66%|██████▌   | 66/100 [<IPV6_REDACTED><56:08, 99.07s/it]
 67%|██████▋   | 67/100 [<IPV6_REDACTED><54:29, 99.07s/it]
 68%|██████▊   | 68/100 [<IPV6_REDACTED><52:50, 99.08s/it]
 69%|██████▉   | 69/100 [<IPV6_REDACTED><51:11, 99.07s/it]
 70%|███████   | 70/100 [<IPV6_REDACTED><49:32, 99.07s/it]
 71%|███████   | 71/100 [<IPV6_REDACTED><47:52, 99.07s/it]
 72%|███████▏  | 72/100 [<IPV6_REDACTED><46:13, 99.06s/it]
 73%|███████▎  | 73/100 [<IPV6_REDACTED><44:34, 99.06s/it]
 74%|███████▍  | 74/100 [<IPV6_REDACTED><42:55, 99.06s/it]
 75%|███████▌  | 75/100 [<IPV6_REDACTED><41:16, 99.06s/it]
 76%|███████▌  | 76/100 [<IPV6_REDACTED><39:37, 99.06s/it]
 77%|███████▋  | 77/100 [<IPV6_REDACTED><37:58, 99.06s/it]
 78%|███████▊  | 78/100 [<IPV6_REDACTED><36:19, 99.06s/it]
 79%|███████▉  | 79/100 [<IPV6_REDACTED><34:40, 99.06s/it]
 80%|████████  | 80/100 [<IPV6_REDACTED><33:01, 99.06s/it]
 81%|████████  | 81/100 [<IPV6_REDACTED><31:22, 99.06s/it]
 82%|████████▏ | 82/100 [<IPV6_REDACTED><29:43, 99.07s/it]
 83%|████████▎ | 83/100 [<IPV6_REDACTED><28:04, 99.07s/it]
 84%|████████▍ | 84/100 [<IPV6_REDACTED><26:25, 99.08s/it]
 85%|████████▌ | 85/100 [<IPV6_REDACTED><24:46, 99.08s/it]
 86%|████████▌ | 86/100 [<IPV6_REDACTED><23:07, 99.08s/it]
 87%|████████▋ | 87/100 [<IPV6_REDACTED><21:28, 99.08s/it]
 88%|████████▊ | 88/100 [<IPV6_REDACTED><19:48, 99.08s/it]
 89%|████████▉ | 89/100 [<IPV6_REDACTED><18:09, 99.08s/it]
 90%|█████████ | 90/100 [<IPV6_REDACTED><16:30, 99.09s/it]
 91%|█████████ | 91/100 [<IPV6_REDACTED><14:51, 99.08s/it]
 92%|█████████▏| 92/100 [<IPV6_REDACTED><13:12, 99.08s/it]
 93%|█████████▎| 93/100 [<IPV6_REDACTED><11:33, 99.07s/it]
 94%|█████████▍| 94/100 [<IPV6_REDACTED><09:54, 99.07s/it]
 95%|█████████▌| 95/100 [<IPV6_REDACTED><08:15, 99.06s/it]
 96%|█████████▌| 96/100 [<IPV6_REDACTED><06:36, 99.07s/it]
 97%|█████████▋| 97/100 [<IPV6_REDACTED><04:57, 99.08s/it]
 98%|█████████▊| 98/100 [<IPV6_REDACTED><03:18, 99.08s/it]
 99%|█████████▉| 99/100 [<IPV6_REDACTED><01:39, 99.09s/it]
100%|██████████| 100/100 [<IPV6_REDACTED><00:00, 99.09s/it]
100%|██████████| 100/100 [<IPV6_REDACTED><00:00, 99.37s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  9936.58   
Total input tokens:                      3276800   
Total generated tokens:                  25600     
Request throughput (req/s):              0.01      
Output token throughput (tok/s):         2.58      
Peak output token throughput (tok/s):    5.00      
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          332.35    
---------------Time to First Token----------------
Mean TTFT (ms):                          34991.60  
Median TTFT (ms):                        34869.53  
P50 TTFT (ms):                           34869.53  
P90 TTFT (ms):                           34915.44  
P95 TTFT (ms):                           36080.29  
P99 TTFT (ms):                           36405.29  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          252.45    
Median TPOT (ms):                        251.80    
P50 TPOT (ms):                           251.80    
P90 TPOT (ms):                           252.29    
P95 TPOT (ms):                           257.91    
P99 TPOT (ms):                           258.29    
---------------Inter-token Latency----------------
Mean ITL (ms):                           252.45    
Median ITL (ms):                         252.65    
P50 ITL (ms):                            252.65    
P90 ITL (ms):                            254.73    
P95 ITL (ms):                            258.28    
P99 ITL (ms):                            265.25    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          99365.62  
Median E2EL (ms):                        99076.91  
P50 E2EL (ms):                           99076.91  
P90 E2EL (ms):                           99198.89  
P95 E2EL (ms):                           101838.86 
P99 E2EL (ms):                           102056.30 
==================================================